### 데이터프레임 인덱싱
- loc ; 라벨값 기반의 2차원 인덱싱
- iloc ; 인덱스 기반의 2차원 인덱싱

### loc

In [38]:
#help(pd.DataFrame)

In [8]:
df = pd.DataFrame({'a':[1,2,3,4,5], 'b':[2,4,6,8,10]})
df

   a   b
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

In [39]:
#help(df.loc)

In [10]:
df.loc[1]

a    2
b    4
Name: 1, dtype: int64

In [14]:
df.loc[1,'a']

2

In [15]:
df.loc[2,'b']

6

In [16]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [17]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [18]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [20]:
df.loc[['b', 'c']]  # df.loc["b":"c"]와 동일

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [21]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [22]:
def sel_rows(df) :
    return df.A > 15

In [24]:
sel_rows(df)  # A열의 값이 15보다 작은 행 걸러내기

a    False
b    False
c     True
Name: A, dtype: bool

In [25]:
df.loc[sel_rows(df)]

    A   B   C   D
c  18  19  20  21

In [26]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [29]:
df.loc["b": , "A":]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [30]:
df.loc["c", :]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [35]:
df.loc[["a","b"],"B":]

    B   C   D
a  11  12  13
b  15  16  17

In [36]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [37]:
df.loc[df.A > 13, ["C","D"]]

    C   D
b  16  17
c  20  21

### iloc

In [41]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [43]:
df.iloc[0,1]

11

In [44]:
df.iloc[:2,2:3]

    C
a  12
b  16

In [45]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int32

In [46]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [47]:
df.iloc[-1] = df.iloc[-2] * 0.5

In [48]:
df

    A     B   C     D
a  10  11.0  12  13.0
b  14  15.0  16  17.0
c   7   7.5   8   8.5

In [71]:
s = pd.Series(range(14))
s[14] = np.nan
s

0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14     NaN
dtype: float64

In [50]:
s.count()

14

In [52]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

### 정렬, 행/열합계
- sort_values(), sort_index()
- sum(), max()..

In [ ]:
df.count()

In [54]:
df.iloc[0,2] = np.nan

In [55]:
df

     0    1    2    3
0  0.0  0.0  NaN  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [138]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [58]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [59]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [60]:
df

     0    1    2    3
0  0.0  0.0  NaN  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [62]:
df[0].value_counts() # 각열마다적용

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [65]:
df.loc[0].value_counts() #행마다count

0.0    2
2.0    1
Name: 0, dtype: int64

In [68]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [69]:
s2.value_counts().sort_values()

2    13
3    14
5    16
4    17
0    18
1    22
dtype: int64

In [73]:
s.sort_values(ascending=False)

13    13.0
12    12.0
11    11.0
10    10.0
9      9.0
8      8.0
7      7.0
6      6.0
5      5.0
4      4.0
3      3.0
2      2.0
1      1.0
0      0.0
14     NaN
dtype: float64

In [77]:
df.sort_values(by = 3)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  NaN  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN

In [78]:
df.sort_values(by=[1,2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  NaN  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [79]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [82]:
df2.sum(axis=0) # 열합계

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [83]:
df2.sum(axis=1) # 행합계

0    35
1    34
2    41
3    42
dtype: int64

In [85]:
#help(df.sum)

In [86]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [89]:
df2.sum() # 원래 디폴트가 열합계

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [90]:
df2.loc["ColTotal", :] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

### apply변환

In [91]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [191]:
#help(df3.apply)

In [94]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [95]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [153]:
df3.apply(pd.value_counts) # 각 열의 value값이 몇 개 사용되었는지

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [154]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [167]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [115]:
df5.apply(lambda x: [3, 4], axis=1, result_type='broadcast')

   0  1
0  3  4
1  3  4
2  3  4
3  3  4
4  3  4

In [161]:
titanic["adult/child"] = titanic.apply(lambda r : "adult" if r.age > 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [166]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
titanic["age"].fillna(titanic["age"].mean(), inplace=True)
titanic["age"] = titanic["age"].astype(int)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult,female
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [164]:
titanic["category1"] = titanic.apply(lambda x : x.sex if x.age > 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult,female
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [168]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult,female
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [187]:
titanic["category2"] = titanic['sex'] + "" + titanic['age'].astype(str) # age컬럼 문자열 변환해서 합치기
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult,female,female29
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

In [206]:
titanic['age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: age, Length: 891, dtype: object

### 실수 값을 카테고리 값으로 변환
- cut ; 실수 값의 경계선을 지정하는 경우
- qcut ; 갯수가 똑같은 구간으로 나누는경우(ex.사분위수)

In [197]:
ages = [0, 2, 10, 21, 23, 37, 80, 61, 20, 41, 32, 101]

In [198]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [199]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [200]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [201]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  4,  3,  0,  2,  2, -1], dtype=int8)

In [202]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [203]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [204]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [220]:
cats_age = pd.cut(titanic["age"].astype(int), bins, labels=labels)
cats_age.astype(str)

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: object

In [221]:
type(cats_age)

pandas.core.series.Series

In [214]:
age_ratio = pd.value_counts(cats_age) / titanic.count()[0]
age_ratio

청년      0.457912
중년      0.268238
미성년자    0.186308
장년      0.067340
노년      0.004489
Name: age, dtype: float64

In [215]:
age_ratio.sum()

0.984287317620651

In [223]:
cats_age.astype(str) + ""+titanic['sex']

0          청년male
1        중년female
2        청년female
3        중년female
4          중년male
          ...
886        청년male
887    미성년자female
888      청년female
889        청년male
890        중년male
Length: 891, dtype: object

In [240]:
def custom(age , sex) :
    if age < 20 :
        return "미성년자"
    else :
        return cats_age.astype(str) + "" + sex
    
titanic["category3"] = titanic.apply(lambda x : custom(int(x["age"]), x["sex"]) , axis = 1 )
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2,category3
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27,청년male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child,female19,미성년자
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,adult,female,female29,청년female
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26,청년male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32,청년male

### 인덱스 설정 및 제거
- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [242]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [244]:
df2 = df1.set_index("C1")  # 기존 인덱스는 사라짐
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [246]:
df2.reset_index() # 인덱스 열은 자료열의 가장 선두로 삽입됨

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [248]:
df2.reset_index(drop=True) # 인덱스를 열로 올리는게 아니라 삭제

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [250]:
# 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.
# 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.
# 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [251]:
df_score1 = pd.DataFrame({
    '국어' : [10,20,30,40],
    '영어' : [25,36,42,31],
    '수학' : [10,88,75,63],
    '과학' : [100,99,98,44]
}, index=['A','B','C','D'])

In [252]:
df_score1

   국어  영어  수학   과학
A  10  25  10  100
B  20  36  88   99
C  30  42  75   98
D  40  31  63   44

In [253]:
df_score2 = df_score1.reset_index()

In [254]:
df_score2

  index  국어  영어  수학   과학
0     A  10  25  10  100
1     B  20  36  88   99
2     C  30  42  75   98
3     D  40  31  63   44

In [256]:
df_score2 = df_score2.set_index("index")  # 기존 인덱스는 사라짐
df_score2

       국어  영어  수학   과학
index
A      10  25  10  100
B      20  36  88   99
C      30  42  75   98
D      40  31  63   44

### 다중 인덱스(multi-index)
> 행이나 열이 여러 계층을 가지는 인덱스

In [259]:
# help(np.random)

In [260]:
np.random.seed(1)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                      columns=[["A","A","B","B"],
                               ["C1","C2","C1","C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.62 -0.61 -0.53 -1.07
1  0.87 -2.30  1.74 -0.76
2  0.32 -0.25  1.46 -2.06
3 -0.32 -0.38  1.13 -1.10
4 -0.17 -0.88  0.04  0.58

In [262]:
df3.columns.names = ["Cidx1", "Cidx2"] # 열 인덱스 이름 지정
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.62 -0.61 -0.53 -1.07
1      0.87 -2.30  1.74 -0.76
2      0.32 -0.25  1.46 -2.06
3     -0.32 -0.38  1.13 -1.10
4     -0.17 -0.88  0.04  0.58

In [263]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]  # 열인덱스명
df4.index.names = ["Ridx1", "Ridx2"] #행인덱스명
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

### 행 인덱스와 열 인덱스 교환
- stack ; 열인덱스 > 행인덱스로 변환
- unstack ; 행인덱스 > 열인덱스로 변환

In [265]:
df4.stack("Cidx1")

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [268]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [269]:
df4.unstack("Ridx1")

Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.76  1.76  0.12  0.40  0.44  0.98  0.33  2.24
id_2   1.49  1.87 -0.21 -0.98  0.31  0.95 -0.85 -0.15
id_3  -2.55 -0.10  0.65  0.41  0.86  0.14 -0.74  1.45

In [270]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.62 -0.61 -0.53 -1.07
1      0.87 -2.30  1.74 -0.76
2      0.32 -0.25  1.46 -2.06
3     -0.32 -0.38  1.13 -1.10
4     -0.17 -0.88  0.04  0.58

In [273]:
df3[("A","C1")] # 튜플로 검색

0    1.62
1    0.87
2    0.32
3   -0.32
4   -0.17
Name: (A, C1), dtype: float64

In [274]:
df3.loc[0, ("B","C1")]

-0.53

In [275]:
df3.iloc[0,2]

-0.53

In [276]:
df4.loc[("M", "id_1"), ("A", "C")]

1.76

In [277]:
df4.loc[:, ("A","C")]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64

In [278]:
df4.loc[("M","id_1"),:]

Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

In [279]:
df4.loc[("All", "All"), :] = df4.sum()
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [280]:
df4.loc["F"]

Cidx1     A           B
Cidx2     C     D     C     D
Ridx2
id_1   0.76  0.12  0.44  0.33
id_2   1.49 -0.21  0.31 -0.85
id_3  -2.55  0.65  0.86 -0.74

In [285]:
df4.loc[("M", slice(None)), :] # 다중 인덱스의 튜플 내에서는 : 슬라이스 사용 불가능

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

In [286]:
df4.loc[(slice(None), "id_1"), :]

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
F     id_1   0.76  0.12  0.44  0.33

### 다중 인덱스의 인덱스 순서 교환
- 다중 인덱스의 인덱스 순서를 바꾸고 싶으면 swaplevel 명령을 사용한다.
- swaplevel(i, j, axis)

In [290]:
df5 = df4.swaplevel("Ridx1","Ridx2")
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [291]:
df6 = df4.swaplevel("Cidx1","Cidx2", 1)
df6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [292]:
# 다중인덱스인 경우 인덱스 정렬 
df5.sort_index(level=0)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
All   All    3.23  0.39  3.68  2.28
id_1  F      0.76  0.12  0.44  0.33
      M      1.76  0.40  0.98  2.24
id_2  F      1.49 -0.21  0.31 -0.85
      M      1.87 -0.98  0.95 -0.15
id_3  F     -2.55  0.65  0.86 -0.74
      M     -0.10  0.41  0.14  1.45

In [295]:
df6.sort_index(axis=1, level=0, ascending=False)

Cidx2           D           C
Cidx1           B     A     B     A
Ridx1 Ridx2
M     id_1   2.24  0.40  0.98  1.76
      id_2  -0.15 -0.98  0.95  1.87
      id_3   1.45  0.41  0.14 -0.10
F     id_1   0.33  0.12  0.44  0.76
      id_2  -0.85 -0.21  0.31  1.49
      id_3  -0.74  0.65  0.86 -2.55
All   All    2.28  0.39  3.68  3.23

In [296]:
df6.sort_index(axis=1, level=1)

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [297]:
# A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.
#“반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.
# df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.
# 데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.
# df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.
# 데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.

In [324]:
np.random.seed(1)
df_score3 = pd.DataFrame({
    '반' : ['A','A','B','B','A','A','B','B','A','B'],
    '번호' : ['12','13','16','22','30','31','5','30','22','10']}
)
df_score3

   반  번호
0  A  12
1  A  13
2  B  16
3  B  22
4  A  30
5  A  31
6  B   5
7  B  30
8  A  22
9  B  10

In [325]:
df_score3["국어"] = [10,20,30,40,50,60,70,20,30,100]
df_score3["영어"] = [11,22,32,42,55,56,62,74,23,33]
df_score3["수학"] = [11,22,32,42,25,36,42,54,63,73]
df_score3

   반  번호   국어  영어  수학
0  A  12   10  11  11
1  A  13   20  22  22
2  B  16   30  32  32
3  B  22   40  42  42
4  A  30   50  55  25
5  A  31   60  56  36
6  B   5   70  62  42
7  B  30   20  74  54
8  A  22   30  23  63
9  B  10  100  33  73

In [329]:
df_score3.index=[df_score3["반"],df_score3["번호"]]

In [364]:
df_score4 = df_score3.drop(["반","번호"], axis=1)
df_score4

       국어  영어  수학
반 번호
A 12   10  11  11
  13   20  22  22
B 16   30  32  32
  22   40  42  42
A 30   50  55  25
  31   60  56  36
B 5    70  62  42
  30   20  74  54
A 22   30  23  63
B 10  100  33  73

In [383]:
df_score4["평균"] = np.round(df_score4.mean(axis=1), 2)  # 열 추가
df_score4

       국어  영어  수학     평균
반 번호
A 12   10  11  11  10.67
  13   20  22  22  21.33
B 16   30  32  32  31.33
  22   40  42  42  41.33
A 30   50  55  25  43.33
  31   60  56  36  50.67
B 5    70  62  42  58.00
  30   20  74  54  49.33
A 22   30  23  63  38.67
B 10  100  33  73  68.67

In [366]:
df_score5 = df_score4

In [375]:
df_score5.drop("평균", axis=1, inplace=True)

In [376]:
df_score5 = df_score5.unstack(0)

In [377]:
df_score5

       국어           영어          수학
반       A      B     A     B     A     B
번호
10    NaN  100.0   NaN  33.0   NaN  73.0
12   10.0    NaN  11.0   NaN  11.0   NaN
13   20.0    NaN  22.0   NaN  22.0   NaN
16    NaN   30.0   NaN  32.0   NaN  32.0
22   30.0   40.0  23.0  42.0  63.0  42.0
30   50.0   20.0  55.0  74.0  25.0  54.0
31   60.0    NaN  56.0   NaN  36.0   NaN
5     NaN   70.0   NaN  62.0   NaN  42.0
Avg  34.0   52.0  33.4  48.6  31.4  48.6

In [384]:
df_score5.loc[("Avg")] = df_score5.mean(axis=0) # 행추가

In [385]:
df_score5

과목     국어           영어          수학
반       A      B     A     B     A     B
번호
10    NaN  100.0   NaN  33.0   NaN  73.0
12   10.0    NaN  11.0   NaN  11.0   NaN
13   20.0    NaN  22.0   NaN  22.0   NaN
16    NaN   30.0   NaN  32.0   NaN  32.0
22   30.0   40.0  23.0  42.0  63.0  42.0
30   50.0   20.0  55.0  74.0  25.0  54.0
31   60.0    NaN  56.0   NaN  36.0   NaN
5     NaN   70.0   NaN  62.0   NaN  42.0
Avg  34.0   52.0  33.4  48.6  31.4  48.6

In [381]:
df_score5.columns.names =["과목","반"]

In [382]:
df_score5

과목     국어           영어          수학
반       A      B     A     B     A     B
번호
10    NaN  100.0   NaN  33.0   NaN  73.0
12   10.0    NaN  11.0   NaN  11.0   NaN
13   20.0    NaN  22.0   NaN  22.0   NaN
16    NaN   30.0   NaN  32.0   NaN  32.0
22   30.0   40.0  23.0  42.0  63.0  42.0
30   50.0   20.0  55.0  74.0  25.0  54.0
31   60.0    NaN  56.0   NaN  36.0   NaN
5     NaN   70.0   NaN  62.0   NaN  42.0
Avg  34.0   52.0  33.4  48.6  31.4  48.6

### 데이터프레임 합성
- merge ; df 병합 (join)
- concat ; 데이터 연결

In [387]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [388]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [391]:
pd.merge(df1, df2)  # inner join

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [390]:
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [392]:
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [393]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [394]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [395]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [396]:
pd.merge(df1, df2, left_on='이름', right_on='성명')

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

In [399]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [398]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [400]:
# 일반 열이 아닌 인덱스를 기준열로 사용
pd.merge(df1, df2, left_on=['도시','연도'], right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [402]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [403]:
df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['대구', '광주'])
df2

     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [404]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [405]:
df1.join(df2, how='outer')

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [406]:
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])

In [407]:
s1

A    0
B    1
dtype: int64

In [408]:
s2

A    2
B    3
C    4
dtype: int64

In [409]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [410]:
pd.concat([s1, s2], axis=1)

     0  1
A  0.0  2
B  1.0  3
C  NaN  4

In [411]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [412]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [413]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0